---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.SchemaName
source: html/50662a69-4395-40c4-8d10-cda8b728cf8e.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.SchemaName Property

The user-friendly name of the Schema.

## Syntax (C#)
```csharp
public string SchemaName { get; }
```